# Pirate Emoji Pandemonium 

from os import system

from time import sleep

x=("""
       /\\
      /  \\
     /    \\
     -| |-
----------------
\              /
 \            /
   -----------
   """)
y=("""
             🛥️🛥️🛥️🛥️🛥️🛥️
         🛥️🛥️🛥️🛥️🛥️🛥️🛥️🛥️
🛥️🛥️🛥️🛥️🛥️🛥️🛥️🛥️🛥️🛥️🛥️🛥️🛥️🛥️🛥️
  🛥️🛥️🛥️🛥️🛥️🛥️🛥️🛥️🛥️🛥️🛥️🛥️🛥️🛥️
    🛥️🛥️🛥️🛥️🛥️🛥️🛥️🛥️🛥️🛥️🛥️🛥️🛥️
       🛥️🛥️🛥️🛥️🛥️🛥️🛥️🛥️🛥️🛥️🛥️







""")
z= ("""
                💣    
             💣   💣
           💣
      💣💣💣💣
    💣💣💣💣💣💣
    💣💣💣💣💣💣
    💣💣💣💣💣💣
      💣💣💣💣


    """)
a=("💥")
b = ("💣")
c = ("🦸")

print("the pirates are attacking!")
sleep(2.5)
for i in range(5):
    print(" " * i, x)
    sleep(0.1)
for i in range(5):
    print(y)
    sleep(0.5)
print("they are attacking the ship with their cannons!")
sleep(2.5)
for i in range(5):
    print("              " * i, z)
    sleep(0.5)
print("the ship exploded!")
sleep(2.5)
print("💥")
sleep(0.5)
print("""
         💥
       💥💥💥
         💥""")
sleep(0.5)
print("""
         💥
       💥💥💥
    💥💥💥💥💥
       💥💥💥
         💥""")
sleep(0.5)
print("""
         💥
       💥💥💥
      💥💥💥💥
    💥💥💥💥 💥
    💥💥💥💥💥💥
      💥💥💥💥
        💥💥      
         💥
      """)
sleep(0.5)
for i in range(25):
    print(" " * i, b)
    sleep(0.1)
print(a * 1560 )
sleep(0.1)
print("☺️", "I will save you!")
sleep(2)
print("👿","NEVER", sleep(0.25), "I WILL DEFEAT YOU")
sleep(2)
for i in range(25):
  print("       ⚔️")
  sleep(0.1)
  print("               ⚔️")
  sleep(0.1)
  print("⚔️")
  sleep(0.1)
  print("       ⚔️")
  sleep(0.1)
sleep(0.5)
print("📜",sleep(0.25), "💬", sleep(0.25),"they fight on and on")